Revit 2024 API
PrintParameters.UserDefinedMarginX Property
 The User defined X value of offset from left bottom corner. Unit is inch.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
[ObsoleteAttribute("This property is obsolete. Use OriginOffsetX instead.")]
public double UserDefinedMarginX { get; set; }
Visual Basic
<ObsoleteAttribute("This property is obsolete. Use OriginOffsetX instead.")> _
Public Property UserDefinedMarginX As Double
	Get
	Set
Visual C++
[ObsoleteAttribute(L"This property is obsolete. Use OriginOffsetX instead.")]
public:
property double UserDefinedMarginX {
	double get ();
	void set (double value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown if PaperPlacement is not Margins and MarginType is not User defined type.
See Also
PrintParameters Class
Autodesk.Revit.DB Namespace